app/controllers/themes_controller.rb

INSERT INTO "themes" ("name", "updated_at", "description", "created_at") VALUES(E'Mourning', '2009-05-11 19:36:50.645000', E'What kind of mourning is described?', '2009-05-11 19:36:50.645000') RETURNING "id"
---
  def create
    @theme = Theme.new(params[:theme])
    if @theme.save

SELECT * FROM "themes" WHERE ("themes"."id" = 1)
---
  def show
    @theme = Theme.find(params[:id])