app/controllers/topics_controller.rb

INSERT INTO "topics" ("name", "updated_at", "description", "created_at") VALUES(E'War', '2009-05-11 19:17:49.019000', E'Study of War passages', '2009-05-11 19:17:49.019000') RETURNING "id"
---
  def create
    @topic = Topic.new(params[:topic])
    if @topic.save

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
---
  def show
    @topic = Topic.find(params[:id])

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
---
  def edit
    @topic = Topic.find(params[:id])

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
---
  def update
    @topic = Topic.find(params[:id])